Revit 2024 API
ExtensibleStorageFilter Constructor
 Constructs a new instance of a filter to match elements with extensible storage data based on specific Schema id.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ExtensibleStorageFilter(
	Guid schemaGuid
)
Visual Basic
Public Sub New ( _
	schemaGuid As Guid _
)
Visual C++
public:
ExtensibleStorageFilter(
	Guid schemaGuid
)
Parameters
schemaGuid
Type: System.Guid
 Schema id used to filter elements with extensible storage data
See Also
ExtensibleStorageFilter Class
Autodesk.Revit.DB.ExtensibleStorage Namespace